# Notebook for understanding OULAD

In [2]:
import pandas as pd
import numpy as np
 
from sqlalchemy import create_engine,text
user = 'root'
passwords = '7003890541'
host = 'localhost'
port = 3306
database = 'open_university'

engine = create_engine(f"mysql+pymysql://{user}:{passwords}@{host}:{port}/{database}")
def sql(query , engine = engine):
    return pd.read_sql(query,engine)


def select(table_name):
    return sql(f'select * from {table_name} limit 5')


def run(query):
    with engine.connect() as con:
        con.execute(text(query))
        con.commit()

In [3]:
query = 'show tables in open_university'
tables = sql(query)
table_names = [col[0] for col in tables.values.tolist()]

In [4]:
table_names

['assessments',
 'courses',
 'studentassessment',
 'studentinfo',
 'studentregistration',
 'studentvle',
 'vle']

In [5]:
for name in table_names:
    print(f'Table: {name}')
    query = f''' select * from {name}
            limit 5;
        '''
    display(sql(query))
    print("_"*50)

Table: assessments

  code_module code_presentation  id_assessment assessment_type   date  weight
0         AAA             2013J           1752             TMA   19.0    10.0
1         AAA             2013J           1753             TMA   54.0    20.0
2         AAA             2013J           1754             TMA  117.0    20.0
3         AAA             2013J           1755             TMA  166.0    20.0
4         AAA             2013J           1756             TMA  215.0    30.0

__________________________________________________
Table: courses

  code_module code_presentation  module_presentation_length
0         AAA             2013J                         268
1         AAA             2014J                         269
2         BBB             2013J                         268
3         BBB             2014J                         262
4         BBB             2013B                         240

__________________________________________________
Table: studentassessment

   id_assessment  id_student  date_submitted  is_banked  score
0           1752       11391              18          0   78.0
1           1752       28400              22          0   70.0
2           1752       31604              17          0   72.0
3           1752       32885              26          0   69.0
4           1752       38053              19          0   79.0

__________________________________________________
Table: studentinfo

,code_module,code_presentation,id_student,gender,region,highest_education,imd_band,age_band,num_of_prev_attempts,studied_credits,disability,final_result
0,AAA,2013J,11391,M,East Anglian Region,HE Qualification,90-100%,55<=,0,240,N,Pass
1,AAA,2013J,28400,F,Scotland,HE Qualification,20-30%,35-55,0,60,N,Pass
2,AAA,2013J,30268,F,North Western Region,A Level or Equivalent,30-40%,35-55,0,60,Y,Withdrawn
3,AAA,2013J,31604,F,South East Region,A Level or Equivalent,50-60%,35-55,0,60,N,Pass
4,AAA,2013J,32885,F,West Midlands Region,Lower Than A Level,50-60%,0-35,0,60,N,Pass

__________________________________________________
Table: studentregistration

,code_module,code_presentation,id_student,date_registration,date_unregistration
0,AAA,2013J,11391,-159.0,NaN
1,AAA,2013J,28400,-53.0,NaN
2,AAA,2013J,30268,-92.0,12.0
3,AAA,2013J,31604,-52.0,NaN
4,AAA,2013J,32885,-176.0,NaN

__________________________________________________
Table: studentvle

  code_module code_presentation  id_student  id_site  date  sum_click
0         AAA             2013J       28400   546652   -10          4
1         AAA             2013J       28400   546652   -10          1
2         AAA             2013J       28400   546652   -10          1
3         AAA             2013J       28400   546614   -10         11
4         AAA             2013J       28400   546714   -10          1

__________________________________________________
Table: vle

   id_site code_module code_presentation activity_type week_from week_to
0   546943         AAA             2013J      resource      None    None
1   546712         AAA             2013J     oucontent      None    None
2   546998         AAA             2013J      resource      None    None
3   546888         AAA             2013J           url      None    None
4   547035         AAA             2013J      resource      None    None

__________________________________________________

In [13]:
df={}
for name in table_names:
    query = f''' select count(*) as total_rows from {name};
        '''
    df[name] = sql(query).iloc[0,0]
pd.DataFrame.from_dict(df,orient='index',columns=['total_rows'])

                     total_rows
assessments                 206
courses                      22
studentassessment        173912
studentinfo               32593
studentregistration       32593
studentvle             10655280
vle                        6364

In [14]:
table_names

['assessments',
 'courses',
 'studentassessment',
 'studentinfo',
 'studentregistration',
 'studentvle',
 'vle']

In [21]:
select('assessments')

  code_module code_presentation  id_assessment assessment_type   date  weight
0         AAA             2013J           1752             TMA   19.0    10.0
1         AAA             2013J           1753             TMA   54.0    20.0
2         AAA             2013J           1754             TMA  117.0    20.0
3         AAA             2013J           1755             TMA  166.0    20.0
4         AAA             2013J           1756             TMA  215.0    30.0

In [18]:
sql('select distinct code_module from assessments')

  code_module
0         AAA
1         BBB
2         CCC
3         DDD
4         EEE
5         FFF
6         GGG

In [19]:
sql('select distinct code_presentation from assessments')

  code_presentation
0             2013J
1             2014J
2             2013B
3             2014B

`ASSESSMENTS -> INFORMATION ABOUT PARTICULAR ASSIGNMENTS`

In [24]:
sql('select * from courses limit 5')

  code_module code_presentation  module_presentation_length
0         AAA             2013J                         268
1         AAA             2014J                         269
2         BBB             2013J                         268
3         BBB             2014J                         262
4         BBB             2013B                         240

`COURSES -> INFORMATION ABOUT PARTICULAR COURSE`

In [26]:
select('studentassessment')

   id_assessment  id_student  date_submitted  is_banked  score
0           1752       11391              18          0   78.0
1           1752       28400              22          0   70.0
2           1752       31604              17          0   72.0
3           1752       32885              26          0   69.0
4           1752       38053              19          0   79.0

`STUDENTASSESSMENT -> JOINING CONDITIONS FOR STUDENT AND ASSESSMENTS`

In [27]:
select('studentinfo')

,code_module,code_presentation,id_student,gender,region,highest_education,imd_band,age_band,num_of_prev_attempts,studied_credits,disability,final_result
0,AAA,2013J,11391,M,East Anglian Region,HE Qualification,90-100%,55<=,0,240,N,Pass
1,AAA,2013J,28400,F,Scotland,HE Qualification,20-30%,35-55,0,60,N,Pass
2,AAA,2013J,30268,F,North Western Region,A Level or Equivalent,30-40%,35-55,0,60,Y,Withdrawn
3,AAA,2013J,31604,F,South East Region,A Level or Equivalent,50-60%,35-55,0,60,N,Pass
4,AAA,2013J,32885,F,West Midlands Region,Lower Than A Level,50-60%,0-35,0,60,N,Pass

In [30]:
sql('select count(distinct id_student) as total_unique_student_id,count(*) as total_rows from studentinfo')

   total_unique_student_id  total_rows
0                    28785       32593

`I WILL CREATE ANOTHER TABLE STUDENT, WITH STUDENT INFORMATION...AND KEEP OTHER COLUMNS IN THIS TABLE`

In [31]:
select('studentregistration')

,code_module,code_presentation,id_student,date_registration,date_unregistration
0,AAA,2013J,11391,-159.0,NaN
1,AAA,2013J,28400,-53.0,NaN
2,AAA,2013J,30268,-92.0,12.0
3,AAA,2013J,31604,-52.0,NaN
4,AAA,2013J,32885,-176.0,NaN

`REGISTRATION DETAILS OF THE STUDENTS`

In [32]:
select('studentvle')

  code_module code_presentation  id_student  id_site  date  sum_click
0         AAA             2013J       28400   546652   -10          4
1         AAA             2013J       28400   546652   -10          1
2         AAA             2013J       28400   546652   -10          1
3         AAA             2013J       28400   546614   -10         11
4         AAA             2013J       28400   546714   -10          1

`STUDENT WHO INTERACTED WITH WHICH VLE`

In [33]:
select('vle')

   id_site code_module code_presentation activity_type week_from week_to
0   546943         AAA             2013J      resource      None    None
1   546712         AAA             2013J     oucontent      None    None
2   546998         AAA             2013J      resource      None    None
3   546888         AAA             2013J           url      None    None
4   547035         AAA             2013J      resource      None    None

`VLE INFORMATION`

`SO THERE ARE TABLES LIKE COURSES, VLE AND NEW TABLE I WILL CREATE STUDENTS ARE ONLY INFORMATION ABOUT THOSE TABLES`

`OTHER TABLES LIKE "STUDENTVLE" IS CONNECTION BETWEEN STUDENT AND VLE, AND STUDENT ASSESMENT IS CONNECTION BETWEEN STUDENT AND ASSIGNMENTS`

In [36]:
sql('select count(distinct id_site) as total_vles from vle')

   total_vles
0        6364

In [37]:
sql('select count(distinct id_student) as total_registered_students from studentregistration')

   total_registered_students
0                      28785

In [38]:
sql('select count(distinct id_student) as total_students from studentinfo')

   total_students
0           28785

In [39]:
sql('select count(distinct code_module) as total_modules from courses')

   total_modules
0              7

In [40]:
sql('select count(distinct id_assessment) as total_assesments from assessments')

   total_assesments
0               206

In [41]:
sql('select count(distinct code_presentation) as total_presentations from courses')

   total_presentations
0                    4